ткрытого документа и попробуем вытащить выделенного сотрудника
	
	Форма = ПолучитьФорму("Документ.НачислениеЗарплаты.ФормаОбъекта",Новый Структура("Ключ",СсылкаНаОбъект));
	
	Если ИдентификаторКоманды = "РасчетныйЛисток_Один" Тогда 
		Попытка 
			Сотр = Форма.Элементы.Начисления.ТекущиеДанные.Сотрудник;
			СписокСорт = Новый СписокЗначений;
			СписокСорт.Добавить(ПолучитьЗначениеРеквизита(Сотр,"ФизическоеЛицо"));
			НовыйЭлементОтбора.ПравоеЗначение = СписокСорт;
		Исключение
			Возврат;
		КонецПопытки;	
	ИначеЕсли ИдентификаторКоманды = "РасчетныйЛисток_Все" Тогда
		
		СписокСорт = Новый СписокЗначений;
		
		Для Каждого Стр из Форма.Объект.ФизическиеЛица Цикл
			СписокСорт.Добавить(Стр.ФизическоеЛицо);		
		КонецЦикла;	
		НовыйЭлементОтбора.ПравоеЗначение = СписокСорт;
	Иначе
		Возврат;
	КонецЕсли;
	
	СформироватьИПоказатьОтчет(СсылкаНаОбъект)
		
КонецПроцедуры	

&НаСервере
Функция ПолучитьЗначениеРеквизита(Ссылка,Реквизит)
	
	Возврат ОбщегоНазначения.ПолучитьЗначениеРеквизита(Ссылка,Реквизит);
	
КонецФункции	

&НаКлиенте
Функция СформироватьПервоначальныеНастройкиИВернутьОтбор(СсылкаНаОбъект)
	
	СтандартныйПериод = Новый СтандартныйПериод();
	ДатаДок = ПолучитьЗначениеРеквизита(СсылкаНаОбъект,"Дата");
	СтандартныйПериод.ДатаНачала    = НачалоМесяца(ДатаДок);
	СтандартныйПериод.ДатаОкончания = КонецМесяца(ДатаДок);
	
	НастройКиДоИзменения = Отчет.КомпоновщикНастроек.Настройки;
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("КлючВарианта", "РасчетныйЛисток");
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Период",СтандартныйПериод);
	
	НовыйЭлементОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора.ЛевоеЗначение  = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")).Поле;
	НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	НовыйЭлементОтбора.ПравоеЗначение = ПолучитьСписокЗначений(СсылкаНаОбъект);
	
	Возврат НовыйЭлементОтбора;
	
КонецФункции	

&НаКлиенте
Процедура СформироватьИПоказатьОтчет(СсылкаНаОбъект)
	
	//Отбор по документу
	ЭлементОтбора_Док = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора_Док.ЛевоеЗначение  = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("Регистратор")).Поле;
	ЭлементОтбора_Док.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора_Док.ПравоеЗначение = СсылкаНаОбъект;

	СкомпоноватьРезультат();
	Этаформа.Элементы.ОсновнаяКоманднаяПанель.Видимость                      = ЛОЖЬ;
	Этаформа.Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = ЛОЖЬ;
	ЭтаФорма.Элементы.Группа2.Видимость                                      = Ложь;
	Этаформа.Открыть();
	
КонецПроцедуры	

&НаКлиенте
Процедура ДляТеста(Команда)
	
	СсылкаНаОбъект = ДокументНачисления;
	
	НовыйЭлементОтбора = СформироватьПервоначальныеНастройкиИВернутьОтбор(СсылкаНаОбъект);
			
	НовыйЭлементОтбора.ПравоеЗначение = ПолучитьСписокЗначений(СсылкаНаОбъект);
		
	//Отбор по документу
	ЭлементОтбора_Док = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора_Док.ЛевоеЗначение  = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("Регистратор")).Поле;
	ЭлементОтбора_Док.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора_Док.ПравоеЗначение = СсылкаНаОбъект;

	СкомпоноватьРезультат();

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокЗначений(СсылкаНаОбъект)
	
	Возврат СсылкаНаОбъект.ФизическиеЛица.ВыгрузитьКолонку("ФизическоеЛицо");
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
     ВариантМодифицирован = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаДиск(Команда)
	
	//Выберем папку
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогОткрытияФайла.Каталог;	
	Иначе
		Предупреждение("Каталог не выбран!");
		Возврат;
	КонецЕсли;
	
	ОбъектыПечати = ПолучитьИзВременногоХранилища(Отчет.АдресВХ);
	
	Для Каждого Стр из ОбъектыПечати Цикл
		
		ТД = Стр.Значение;
		ТД.АвтоМасштаб = Истина;
		ТД.Записать(ПутьКФайлу + "\" + Стр.Представление + ".pdf",ТипФайлаТабличногоДокумента.PDF);
		
	КонецЦикла;	
	
КонецПроцедуры

	